using System.Text;

namespace NetworkProgrammingP47
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.OutputEncoding = Encoding.UTF8;

            // new HttpDemo().RunAsync().Wait();
            // new ApiDemo().Run();
            // new SmtpDemo().Run();
            new UserService().Run();

            Console.WriteLine("Program finished");
        }
    }
}
/* Робота з мережею.
 * Мережа (комп'ютерна) - сукупність вузлів, поєднаних лініями зв'язку
 * Вузол - активний компонент (з виконанням кодів) - ПК, принтер, сканер, роутер тощо
 * Канал (лінія зв'язку) - засіб для обміну даними між вузлами.
 * Топологія мережі - спосіб (схема) утворення каналів та розширення мережі
 *  "кільце" - всі учасники мережі поєднані між собою із замиканням першого та останнього
 *  ...
 *  "зірка" - принцип подібності за яким кожен вузол мережі може бути власною мережею
 * Протоколи - набори правил взаємодії у мережі. Структура взаємодії та відповідні
 *  типи протоколів задаються стандартом OSI (https://uk.wikipedia.org/wiki/%D0%9C%D0%B5%D1%80%D0%B5%D0%B6%D0%B5%D0%B2%D0%B0_%D0%BC%D0%BE%D0%B4%D0%B5%D0%BB%D1%8C_OSI)
 * Операційна система - системи з підтримкою мережевого програмного забезпечення
 *  сервер (callee) - програма яка знаходиться у постійному "прослуховуванні"
 *  клієнт (caller) - програма, яка ініціює комунікацію, викликаючи сервер
 * 
 * 
 * У програмуванні
 * Сокет - узагальнена назва способу обміну даними між вузлами мережі:
 *  два вузли відкривають між собою сокет
 *  один вузол пише у сокет
 *  інший вузол читає з сокету
 * ІР - адреса мережного вузла, що є числом, яке подається поділеним на групи
 *         IPv4: 45.123.8.15 -- 32 біти, представлені по 8 біт десятичними числами
 * Доменне ім'я (хост-ім'я) - рядкова назва мережного вузла. Для Інтернет - це URL     
 * URL - Uniform Resource Locator - рядок (посилання), яке дозволяє "перейти" до ресурсу
 *    https://api.myshop.ua:443/product/asus/412?lang=uk&color=gray
 *    https - протокол (схема) 
 *    api.myshop.ua - Доменне ім'я
 *     ua - домен першого (верхнього) рівня - перелік регулюється світовими стандартами
 *     myshop - домен другого рівня -- видаються/продаються провайдерами (хостерами)
 *     api - субдомен -- створюється користувачем
 *    /product/asus/412 - path або slug - внутрішній ідентифікатор ресурса
 *       path є завжди, якщо нічого не зазначено, то приймається "/"
 *    lang=uk&color=gray - Query (query-string) у форматі: ключ=значення, роздільник - &
 * URI - Uniform Resource Identifier - рядок, який ідентифікує ресурс, але не обов'язково
 *         дозволяє на нього перейти. Можна дати приклад - посилання на літературу чи 
 *         компакт-диск, що офіційно видавався
 * DNS - служба доменних імен -- таблиці співставлення доменних імен та ІР адрес вузлів
 * 
 * Порт (мережевий порт) - число, яке дозволяє розрізнювати програми на 
 *  одному вузлі.
 *  Servers             IP       Client      Port
 *  [ MyStat    ]<---\      /--->| Browser | 80 та 443
 *  [ Teams-Hub ]<---- Node ---->| Teams   | 3124
 *  [ GitHub    ]<---/      \--->| MS VS   | 5231
 *                      
 *  При запуску серверної програми вона реєструє за собою порт, якщо цей порт
 *  вільний, то операційна система фіксує цей порт за програмою та у подальшому
 *  передає пакети, що приходять на відповідний порт, до прив'язаної до нього
 *  програми. Якщо порт зайнятий, то старт програми скасовується.
 *  Порінюючи з реальним світом
 *  ІР - адреса (будинку)
 *  Порт - номер квартири
 *  
 *  Повна адреса приймача даних - це Хост(ІР) та порт - endpoint
 *  
 *  Д.З. Реалізувати повну валідацію URL з урахуванням, що 
 *  до неї може бути включений порт. Відображати усі відокремлені
 *  частини. Додати скріншоти
 */
